"""TASK CPython 4."""

# Введение в Python и CPython
# 1. Что такое CPython и чем он отличается от Python? CPython - это реализация
# языка программирования python (основная), она отличается от Python тем, что для
# ее создания использовался язык программирования C (все ядро написано на языке
# си)
#
# 2. Сколько существует реализаций Python, и какая из них самая популярная?
# Согласно видео, существует 6 реализаций языка пайтон: CPython, PyPy, Jython,
# IronPython, Cython и MicroPython/CircuitPython. Самая популярная - CPython.
# Более точное число - несколько десятков, но именно самых активных - 6.
# 3. На каком языке написан CPython? Язык программирования C
#
# Поиск и установка CPython
# 4. (опционально) Кто создал CPython? CPython создал Гвидо ван Россум (Guido van
# Rossum), голландский программист, который также является автором самого языка
# Python
#
# 5. Почему Python считается быстрым, несмотря на то, что это интерпретируемый
# язык? На самом деле, чистый Python — медленный язык, так как интерпретатору
# требуется время на динамическую типизацию и выполнение байт-кода. Однако под
# «быстротой» часто понимают два других фактора:
# • Высокую скорость разработки благодаря лаконичному и простому синтаксису.
# • Быстродействие тяжелых библиотек (NumPy, pandas и др.), критически важные
# части которых написаны на низкоуровневых C/C++ и выполняются скомпилированными.
#
# 6. Напишите путь к Интерпретатору CPython на вашем компьютере:
# C:\Users\1\AppData\Local\Python\pythoncore-3.14-64
#
# Структура CPython
# 7. Что содержится в папке include в CPython? заголовочные файлы, написанные на
# C:
# Зачем они нужны: Они содержат объявления функций, макросов и структур
# данных (например, базовую структуру любого объекта в Python — PyObject).
# Роль в экосистеме: Именно эти файлы используются, когда разработчики пишут
# свои расширения на Си/C++ (C Extensions) для Python, чтобы интегрировать
# сторонний код с виртуальной машиной CPython.
#
# 8. Где можно найти исходный код CPython, дайте ссылку на репозиторий гитхаб:
# https://github.com/python/cpython
#
# 9. (опционально) Как работает интерпретатор CPython при выполнении кода?
# Интерпретатор CPython - это программа, написанная на си, которая читает и
# выполняет код, написанный на пайтон. Сначала весь модуль компилируется в
# байт-код, затем виртуальная машина (PVM) выполняет инструкции байт-кода.
#
# 1) Компиляция в байт-код: CPython берет ваш .py файл, проверяет синтаксис и
# переводит его в промежуточный байт-код (набор простых инструкций).
# 2) Запуск PVM (Python Virtual Machine): Программа на Си (интерпретатор)
# запускает бесконечный цикл.
# 3) Построчное выполнение: Внутри этого цикла интерпретатор берет одну
# инструкцию байт-кода, находит соответствующую ей функцию, написанную на Си, и
# выполняет её на процессоре. Затем переходит к следующей.
#
#
# Запуск файла с помощью CPython
# 10. Какая команда используется для запуска файла с помощью CPython? cmd - для
# запуска командной строки. Для того чтобы запустить файл непосредственно, пишем
# путь до интерпретатора + пробел + путь до запускаемого файла. Структура: python
# <путь_к_файлу> (или полный путь к интерпретатору и затем путь к файлу)
#
# 11. Можно ли запускать текстовые файлы через интерпретатор Python? Почему? Да,
# потому что пайтон смотрит на содержимое файла, а не на расширение. Если внутри
# корректный Python-код, файл .txt тоже выполнится.
#
# 12. Как указать путь к интерпретатору и файлу для выполнения кода? Указывать
# нужно полный путь до файла, включая название и расширение файла (через слэш
# после копирования из верхней строки в проводнике, в нужной директории)
#
#
# Введение в PyPy
# 13. Чем PyPy отличается от CPython? Главное отличие — это скорость работы и
# способ взаимодействия с расширениями. PyPy написан на RPython (строгом
# подмножестве Python) и использует JIT-компиляцию, что позволяет ему выполнять
# вычисления гораздо быстрее CPython. Однако у PyPy ниже совместимость с
# Си-библиотеками. Они создавались под C API стандартного CPython, поэтому в PyPy
# они работают через встроенный слой совместимости (cpyext), что снижает
# производительность и иногда приводит к ошибкам.
#
# 14. Почему PyPy не может использоваться для всех проектов на Python? Из-за
# плохой совместимости с некоторыми библиотеками, медленного разогрева (короткие
# программы обычно медленнее, чем на CPython), отставание по отношению к новым
# версиям языка, более высокое потребление оперативной памяти
#
# 15. Где можно скачать PyPy? https://pypy.org/
#
# Установка и запуск PyPy
# 16. Как установить PyPy после скачивания? Распаковать скачанный архив в любую
# удобную директорию
#
# 17. Как запустить файл с помощью PyPy? В командной строке ввести полный путь до
# интерпретатора + пробел + полный путь до файла (пути содержат названия файлов
# с их расширениями)
#
# 18. Почему PyPy выполняет код быстрее, чем CPython? PyPy работает быстрее за
# счёт JIT-компиляции (Just-In-Time). CPython компилирует код в байт-код и
# интерпретирует его, а PyPy дополнительно компилирует «горячие» участки в
# машинный код (JIT).
#
#
# Практические задания
# Задание 1: Поиск и установка CPython
# (см. скриншот в cpython.ipynb)
#
# Задание 2: Исследование структуры CPython
# (см. скриншот в cpython.ipynb)
# Путь к CPython: C:\Users\1\AppData\Local\Python\pythoncore-3.14-64
# В папке include 79 файлов с расширением .h, написанных на си. Также в каждой
# папке на следующем уровне в немалом количестве содержатся файлы с таким же
# расширением.
# (см. скриншот в cpython.ipynb)
#
# Задание 3: Запуск файла с помощью CPython
# (см. скриншот в cpython.ipynb)
#
# Задание 4: Установка и использование PyPy
# (см. скриншот в cpython.ipynb)
#
# Задание 5: Сравнение производительности CPython и PyPy
# (см. скриншот в cpython.ipynb)
# На скриншоте можно видеть, что PyPy выполнил данную программу значительно
# быстрее (примерно в 153 раза быстрее)
